{
  "date": "2026-02-12",
  "international": [
    {
      "title": "AG Bondi Hurls Insults at Lawmakers as She Defends Handling of Epstein Files",
      "pub_date": "2026-02-12",
      "desc": "Attorney General Pam Bondi insulted Democrats during a House Judiciary Committee hearing about the Justice Department's handling of Epstein files, refusing to answer questions about indicting co-conspirators.",
      "url": "https://www.democracynow.org/2026/2/12/headlines"
    },
    {
      "title": "India Clears Proposal to Buy 114 Rafale Fighter Jets from France",
      "pub_date": "2026-02-12",
      "desc": "India's Defence Acquisition Council approved the purchase of 114 Rafale fighter jets from Dassault Aviation, days before French President Macron's visit for the AI Summit.",
      "url": "https://www.thehindu.com/news/national/defence-acquisition-council-rafale-jets-acquisition-proposal/article70623645.ece"
    },
    {
      "title": "Trump's EPA Will Stop Regulating Greenhouse Gases",
      "pub_date": "2026-02-12",
      "desc": "The Trump administration announced EPA will end greenhouse gas regulation, setting up a legal fight with environmental groups over the endangerment finding.",
      "url": "https://www.npr.org/2026/02/11/nx-s1-5678273/trump-epa-climate-change-endangerment"
    },
    {
      "title": "India Retail Inflation Climbs to 2.75% in January 2026",
      "pub_date": "2026-02-12",
      "desc": "India's inflation rate accelerated to 2.75% in January under the new CPI series, returning to the RBI's target band for the first time since August.",
      "url": "https://www.thehindu.com/business/Economy/india-january-2026-retail-inflation-cpi-series-new-data/article70623793.ece"
    }
  ],
  "china": [
    {
      "title": "China Completes First Recovery of Spacecraft Return Capsule from Sea",
      "pub_date": "2026-02-11",
      "desc": "China successfully conducted its first maritime search and retrieval of a crewed spacecraft's return capsule during the Mengzhou spaceship test, crucial for lunar landing plans.",
      "url": "https://english.news.cn/20260211/f4722201f1dc4245b1da23b0a2b60f4b/c.html"
    },
    {
      "title": "ByteDance Unveils Seedance 2.0 AI Video Model",
      "pub_date": "2026-02-12",
      "desc": "ByteDance officially unveiled Seedance 2.0, its next-generation video-generating AI model, sparking viral frenzy on Chinese social media with Elon Musk noting 'It's happening fast'.",
      "url": "https://www.latestly.com/technology/what-is-seedance-2-0-all-about-bytedances-new-ai-video-model-going-viral-in-china-as-elon-musk-says-its-happening-fast-7311969.html"
    },
    {
      "title": "China Issues New Rules to Curb Auto Price War",
      "pub_date": "2026-02-12",
      "desc": "China moved to curb a fierce price war among automakers after passenger car sales dropped nearly 20% in January, causing massive industry losses.",
      "url": "https://www.wptf.com/2026/02/12/china-issues-new-rules-to-curb-auto-price-war-after-january-passenger-car-sales-drop-20/"
    },
    {
      "title": "China's Top Chipmaker SMIC Warns Rushed AI Capacity Could Sit Idle",
      "pub_date": "2026-02-11",
      "desc": "SMIC warned that breakaway spending on AI chips is bringing forward years of future demand, raising the risk that some data centers could sit idle.",
      "url": "https://www.bloomberg.com/news/articles/2026-02-11/china-s-top-chipmaker-warns-rushed-ai-capacity-could-sit-idle"
    }
  ],
  "hongkong": [
    {
      "title": "Hong Kong's Investment Attraction Scheme Receives Over 3,000 Applications",
      "pub_date": "2026-02-12",
      "desc": "Hong Kong's New Capital Investment Entrant Scheme received over 3,000 applications with more than 1,600 formally approved, involving potential investments exceeding 90 billion HK dollars.",
      "url": "https://en.people.cn/n3/2026/0212/c90000-20425416.html"
    },
    {
      "title": "Father of US-Based Hong Kong Activist Convicted Under National Security Law",
      "pub_date": "2026-02-11",
      "desc": "The father of a U.S.-based activist wanted by Hong Kong authorities was convicted of attempting to deal with an absconder's financial assets in the first case of its kind under the national security law.",
      "url": "https://www.kunr.org/world-headlines/2026-02-11/father-of-us-based-hong-kong-activist-convicted-under-national-security-law"
    },
    {
      "title": "Hong Kong's CK Hutchison Warns of Legal Action Over Panama Canal Ports",
      "pub_date": "2026-02-12",
      "desc": "CK Hutchison warned of legal action over Panama Canal ports amid ongoing controversy about the company's control of strategic shipping lanes.",
      "url": "https://www.greenfieldreporter.com/2026/02/12/hong-kongs-ck-hutchison-warns-of-legal-action-over-panama-canal-ports/"
    }
  ],
  "gds": [
    {
      "title": "GDS Holdings-SW Surges Over 3%",
      "pub_date": "2026-02-12",
      "desc": "GDS Holdings stock opened at HK$45.92 and traded at HK$46.10, up more than 3%. Mainstream funds recorded net inflows for 16 consecutive days with accelerating capital inflows.",
      "url": "https://news.futunn.com/en/post/68796329/early-session-movement-gds-holdings-sw-surges-over-3-with"
    },
    {
      "title": "Top 5 AI Data Center Stocks to Watch in 2026",
      "pub_date": "2026-02-12",
      "desc": "AI data centers remain a hot sector in 2026 with strong demand for computing infrastructure. Analysts highlight key players positioned to benefit from AI boom.",
      "url": "https://ng.investing.com/news/stock-market-news/top-5-ai-data-center-stocks-to-watch-in-2026-according-to-warrenai-93CH-2340414"
    },
    {
      "title": "Caterpillar Taps AI Data Center Power Demand With 2 GW Deal",
      "pub_date": "2026-02-11",
      "desc": "Caterpillar agreed to supply 2 GW of natural gas generator sets to the Monarch Compute Campus AI data center project, highlighting growing power infrastructure needs.",
      "url": "https://simplywall.st/stocks/us/capital-goods/nyse-cat/caterpillar/news/caterpillar-taps-ai-data-center-power-demand-with-2-gw-deal"
    }
  ],
  "ai": [
    {
      "title": "OpenAI Accuses DeepSeek of Distilling US Models",
      "pub_date": "2026-02-12",
      "desc": "OpenAI warned U.S. lawmakers that Chinese AI startup DeepSeek is using sophisticated methods to extract results from leading US AI models to gain competitive advantage.",
      "url": "https://www.reuters.com/world/china/openai-accuses-deepseek-distilling-us-models-gain-advantage-bloomberg-news-2026-02-12/"
    },
    {
      "title": "OpenAI's New Spark Model Codes 15x Faster",
      "pub_date": "2026-02-12",
      "desc": "OpenAI announced GPT-5.3-Codex-Spark, a smaller model that generates code 15 times faster while remaining highly capable. Available first to Pro tier users.",
      "url": "https://www.zdnet.com/article/openais-gpt-5-3-codex-spark-15x-faster/"
    },
    {
      "title": "A Year On From DeepSeek Shock, Low-Cost Chinese AI Models Expected",
      "pub_date": "2026-02-12",
      "desc": "One year after DeepSeek rattled the global tech industry with low-cost models, Chinese rivals are preparing to launch new AI models with more consumer appeal.",
      "url": "https://www.investing.com/news/stock-market-news/a-year-on-from-deepseek-shock-get-set-for-flurry-of-lowcost-chinese-ai-models-4501688"
    },
    {
      "title": "China's GLM-5 Sets New Standard With Record-Low Mistakes",
      "pub_date": "2026-02-12",
      "desc": "Z.ai's GLM-5 model achieved record-low error rates using DeepSeek Sparse Attention, handling a 200,000 token context window while keeping costs manageable.",
      "url": "https://softtechhub.us/2026/02/12/chinas-glm-5/"
    },
    {
      "title": "OpenAI Updates Deep Research With GPT-5.2",
      "pub_date": "2026-02-12",
      "desc": "OpenAI announced significant updates to Deep Research on ChatGPT with GPT-5.2, offering greater precision and speed in information synthesis with advanced full-screen reporting.",
      "url": "https://www.mixvale.com.br/2026/02/12/openai-updates-deep-research-on-chatgpt-with-gpt-5-2-and-advanced-full-screen-reporting-en/"
    },
    {
      "title": "Anthropic Claude Promises to Remain Ad-Free",
      "pub_date": "2026-02-11",
      "desc": "After news that OpenAI is planning ads in ChatGPT, Anthropic published a blog post explaining why advertising incentives are incompatible with a genuinely helpful AI assistant.",
      "url": "https://www.zdnet.com/article/best-ai-chatbot/"
    },
    {
      "title": "AI Leaders Flee as Doomsday Scenario Arrives",
      "pub_date": "2026-02-12",
      "desc": "Leading AI models including Anthropic's Claude and OpenAI's ChatGPT are improving rapidly, even building new products themselves, causing market disruptions.",
      "url": "https://www.axios.com/2026/02/12/ai-openai-agi-xai-doomsday-scenario"
    }
  ]
}
